<a href="https://colab.research.google.com/github/ksh001/python/blob/main/py_05_pd.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#pandas 예습

##선택

In [3]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('/data.csv', encoding='cp949')

In [10]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

###4. iloc을 활용한 인덱스 지정 선택

In [11]:
df.iloc[2, 1] #행렬

'전용면적 60㎡초과 85㎡이하'

In [12]:
df.iat[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [13]:
df.iloc[2, :]

지역명                      서울
규모구분       전용면적 60㎡초과 85㎡이하
연도                     2015
월                        10
분양가격(㎡)                5882
Name: 2, dtype: object

In [14]:
df.iloc[:5, 1]

0                   전체
1           전용면적 60㎡이하
2     전용면적 60㎡초과 85㎡이하
3    전용면적 85㎡초과 102㎡이하
4          전용면적 102㎡초과
Name: 규모구분, dtype: object

In [15]:
# iloc으로 인덱스 지정시 : 기준으로 왼쪽은 포함, : 기준으로 오른쪽은 미만 _ 범위
df.iloc[:5, 1:3]

                규모구분    연도
0                 전체  2015
1         전용면적 60㎡이하  2015
2   전용면적 60㎡초과 85㎡이하  2015
3  전용면적 85㎡초과 102㎡이하  2015
4        전용면적 102㎡초과  2015

In [16]:
df.iat[:2, 1]

ValueError: ignored

###5. 범위 조건 지정 선택

In [21]:
df[df.index > 4585]

     지역명               규모구분    연도  월 분양가격(㎡)
4586  제주         전용면적 60㎡이하  2020  3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4589  제주        전용면적 102㎡초과  2020  3    3601

In [19]:
df[df.연도 == 2019][:5] #df.a == df['a']

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

In [22]:
df[df['연도'] == 2019][:5]

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

##copy

In [23]:
copy = df.copy()

In [24]:
df

     지역명               규모구분    연도   월 분양가격(㎡)
0     서울                 전체  2015  10    5841
1     서울         전용면적 60㎡이하  2015  10    5652
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     서울        전용면적 102㎡초과  2015  10    5879
...   ..                ...   ...  ..     ...
4585  제주                 전체  2020   3    3955
4586  제주         전용면적 60㎡이하  2020   3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020   3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020   3     NaN
4589  제주        전용면적 102㎡초과  2020   3    3601

[4590 rows x 5 columns]

In [25]:
copy

     지역명               규모구분    연도   월 분양가격(㎡)
0     서울                 전체  2015  10    5841
1     서울         전용면적 60㎡이하  2015  10    5652
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     서울        전용면적 102㎡초과  2015  10    5879
...   ..                ...   ...  ..     ...
4585  제주                 전체  2020   3    3955
4586  제주         전용면적 60㎡이하  2020   3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020   3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020   3     NaN
4589  제주        전용면적 102㎡초과  2020   3    3601

[4590 rows x 5 columns]

##값지정

In [27]:
df['지역명'][:5]

0    서울
1    서울
2    서울
3    서울
4    서울
Name: 지역명, dtype: object

In [28]:
df.loc[:, ['지역명', '연도']][:5] #좌측에 조건 삽입 가능

  지역명    연도
0  서울  2015
1  서울  2015
2  서울  2015
3  서울  2015
4  서울  2015

In [26]:
df.loc[df['지역명']=='서울','지역명'][:10]

0     서울
1     서울
2     서울
3     서울
4     서울
85    서울
86    서울
87    서울
88    서울
89    서울
Name: 지역명, dtype: object

In [29]:
# 지역명 == 서울 인 지역을 Seoul로 변경(값을 set)
df.loc[df['지역명']=='서울','지역명'] = 'Seoul'

In [31]:
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

##reindex를 통한 지정 행과 새로운 열을 추가하여 새로운 dataframe으로 생성

###index바꾸기

In [40]:
new_index = [0, 1, 'a']
df1 = df.reindex(new_index)

df1

     지역명        규모구분      연도     월 분양가격(㎡)
0  Seoul          전체  2015.0  10.0    5841
1  Seoul  전용면적 60㎡이하  2015.0  10.0    5652
a    NaN         NaN     NaN   NaN     NaN

In [44]:
df1.reindex(new_index, fill_value=0)

     지역명        규모구분      연도     월 분양가격(㎡)
0  Seoul          전체  2015.0  10.0    5841
1  Seoul  전용면적 60㎡이하  2015.0  10.0    5652
a    NaN         NaN     NaN   NaN     NaN

### column 바꾸기

In [47]:
df.reindex(columns=['지역명', '규모구분', 'A'])[:5]

     지역명               규모구분   A
0  Seoul                 전체 NaN
1  Seoul         전용면적 60㎡이하 NaN
2  Seoul   전용면적 60㎡초과 85㎡이하 NaN
3  Seoul  전용면적 85㎡초과 102㎡이하 NaN
4  Seoul        전용면적 102㎡초과 NaN

In [50]:
df.reindex(['지역명', '규모구분', 'A'], axis="columns")[:5]

     지역명               규모구분   A
0  Seoul                 전체 NaN
1  Seoul         전용면적 60㎡이하 NaN
2  Seoul   전용면적 60㎡초과 85㎡이하 NaN
3  Seoul  전용면적 85㎡초과 102㎡이하 NaN
4  Seoul        전용면적 102㎡초과 NaN

In [ ]:
df

###예제

In [67]:
df2 = df.reindex(index=df.index[:7], columns=list(df.columns) + ['extra'])
#df에 index를 새로 만들건데, index는 df의 6칸까지 그대로 유지하고,
# column은 df의 column을 유지하고 extra를 추가해라

df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [68]:
df2.loc[:4, 'extra'] = False
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [66]:
df2.loc[:4, 'extra'] = 3
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841      3
1  Seoul         전용면적 60㎡이하  2015  10    5652      3
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882      3
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721      3
4  Seoul        전용면적 102㎡초과  2015  10    5879      3

##빈 데이터 처리

In [59]:
df3 = df2.copy()
df3

     지역명               규모구분    연도   월 분양가격(㎡) extra
0  Seoul                 전체  2015  10    5841     3
1  Seoul         전용면적 60㎡이하  2015  10    5652     3
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882     3
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721     3
4  Seoul        전용면적 102㎡초과  2015  10    5879     3
5     인천                 전체  2015  10    3163   NaN
6     인천         전용면적 60㎡이하  2015  10    3488   NaN

In [63]:
df3.dropna(how='any')

     지역명               규모구분    연도   월 분양가격(㎡) extra
0  Seoul                 전체  2015  10    5841     3
1  Seoul         전용면적 60㎡이하  2015  10    5652     3
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882     3
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721     3
4  Seoul        전용면적 102㎡초과  2015  10    5879     3

In [64]:
df3

     지역명               규모구분    연도   월 분양가격(㎡) extra
0  Seoul                 전체  2015  10    5841     3
1  Seoul         전용면적 60㎡이하  2015  10    5652     3
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882     3
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721     3
4  Seoul        전용면적 102㎡초과  2015  10    5879     3
5     인천                 전체  2015  10    3163   NaN
6     인천         전용면적 60㎡이하  2015  10    3488   NaN

원본 데이터에 반영시키기

In [69]:
df3.dropna(how='any', inplace=True)
df3

     지역명               규모구분    연도   월 분양가격(㎡) extra
0  Seoul                 전체  2015  10    5841     3
1  Seoul         전용면적 60㎡이하  2015  10    5652     3
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882     3
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721     3
4  Seoul        전용면적 102㎡초과  2015  10    5879     3

In [70]:
df3 = df2.copy()
df3.fillna(value=True) #None에만 값 넣기

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163   True
6     인천         전용면적 60㎡이하  2015  10    3488   True

In [71]:
pd.isna(df3) #NaN 값이 있는 데이터를 Boolean 으로 출력

     지역명   규모구분     연도      월  분양가격(㎡)  extra
0  False  False  False  False    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False
5  False  False  False  False    False   True
6  False  False  False  False    False   True